tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "r-lib/rig"
tap "tsonglew/dutis", "https://github.com/tsonglew/dutis"
brew "jpeg-xl"
brew "aom"
brew "protobuf"
brew "grpc"
brew "sqlite"
brew "apache-arrow"
brew "libgit2"
brew "bat"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "bib-tool"
brew "node"
brew "bitwarden-cli"
brew "boost"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diskus"
brew "duf"
brew "dust"
brew "duti"
brew "entr"
brew "exiftool"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "libbluray"
brew "ffmpeg"
brew "fileicon"
brew "fzf"
brew "gcc"
brew "pkg-config"
brew "libheif"
brew "librttopo", args: ["HEAD"]
brew "libxml2"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "glances"
brew "gobject-introspection"
brew "grip"
brew "gsl"
brew "htop"
brew "liblqr", args: ["HEAD"]
brew "imagemagick"
brew "jenv"
brew "jq"
brew "pandoc"
brew "jupyterlab"
brew "libfido2"
brew "libproxy"
brew "libressl"
brew "librsvg"
brew "libsvg"
brew "llvm@17"
brew "locateme"
brew "lsd"
brew "m-cli"
brew "mackup"
brew "mailsy"
brew "mariadb-connector-c"
brew "mas"
brew "mysql"
brew "neovim"
brew "oh-my-posh"
brew "opendetex"
brew "tree"
brew "pass"
brew "pianobar"
brew "pipx"
brew "python@3.11"
brew "python@3.9"
brew "pytorch"
brew "qemu"
brew "qpdf"
brew "qt"
brew "qt@5"
brew "tcl-tk"
brew "r"
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruff"
brew "speedtest-cli"
brew "stow"
brew "subversion"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "typst"
brew "udunits"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "z"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "tsonglew/dutis/dutis"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "appcleaner"
cask "audacity"
cask "bettermouse"
cask "bitwarden"
cask "calibre"
cask "chromedriver"
cask "docker"
cask "drawio"
cask "dropbox"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-noto-mono"
cask "font-noto-serif"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-source-serif-4"
cask "google-chrome"
cask "google-drive"
cask "jordanbaird-ice"
cask "kap"
cask "mullvadvpn"
cask "obsidian"
cask "pichon"
cask "plex"
cask "plex-media-server"
cask "praat"
cask "quarto"
cask "raycast"
cask "rectangle"
cask "rstudio"
cask "sequel-ace"
cask "shortcat"
cask "spotify"
cask "stolendata-mpv"
cask "superduper"
cask "textbar"
cask "todoist"
cask "transcribe"
cask "transmission"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
cask "zotero@beta"
mas "Adblock Plus", id: 1432731683
mas "AudioBookBinder", id: 413969927
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "IPA Keyboard", id: 1461264628
mas "iPreview", id: 1519213509
mas "Keynote", id: 409183694
mas "Memory Diag", id: 748212890
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Suggester", id: 1106482294
mas "Triode", id: 1450027401
mas "Vinegar", id: 1591303229
vscode "adpyke.codesnap"
vscode "ahayman.merriam-webster-thesaurus"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "kirozen.wordcounter"
vscode "mechatroner.rainbow-csv"
vscode "mgt19937.typst-preview"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.theme-tomorrowkit"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
vscode "pkief.material-icon-theme"
vscode "quarto.quarto"
vscode "reditorsupport.r"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "yescode.terminal-theme"
vscode "yzhang.markdown-all-in-one"
